cell_1 = input('1 клетка: ')
cell_2 = input('2 клетка: ')


playing_field = {
    '1a': 'b', '1b': 'w', '1c': 'b', '1d': 'w', '1e': 'b', '1f': 'w', '1g': 'b', '1h': 'w',
    '2a': 'w', '2b': 'b', '2c': 'w', '2d': 'b', '2e': 'w', '2f': 'b', '2g': 'w', '2h': 'b',
    '3a': 'b', '3b': 'w', '3c': 'b', '3d': 'w', '3e': 'b', '3f': 'w', '3g': 'b', '3h': 'w',
    '4a': 'w', '4b': 'b', '4c': 'w', '4d': 'b', '4e': 'w', '4f': 'b', '4g': 'w', '4h': 'b',
    '5a': 'b', '5b': 'w', '5c': 'b', '5d': 'w', '5e': 'b', '5f': 'w', '5g': 'b', '5h': 'w',
    '6a': 'w', '6b': 'b', '6c': 'w', '6d': 'b', '6e': 'w', '6f': 'b', '6g': 'w', '6h': 'b',
    '7a': 'b', '7b': 'w', '7c': 'b', '7d': 'w', '7e': 'b', '7f': 'w', '7g': 'b', '7h': 'w',
    '8a': 'w', '8b': 'b', '8c': 'w', '8d': 'b', '8e': 'w', '8f': 'b', '8g': 'w', '8h': 'b'
}



if playing_field[cell_1] == playing_field[cell_2]:
    print('да')
else:
    print('нет')



# 1 клетка: 1a
# 2 клетка: 2b
# да

# 1 клетка: 6d
# 2 клетка: 5d
# нет