cities = [
    {
        'Барнаул': 2,
        'Ижевск': 4,
        'Иркутск': 5,
        'Казань': 4,
        'Новокузнецк': 5,
        'Пермь': 1,
        'Уфа': 5,
        'Хабаровск': 5,
        'Ярославль': 5
    },
    {
        'Барнаул': 2,
        'Воронеж': 3,
        'Иркутск': 6,
        'Казань': 1,
        'Оренбург': 6,
        'Тюмень': 5
    },
    {
        'Казань': 2,
        'Краснодар': 6,
        'Красноярск': 7,
        'Новосибирск': 1,
        'Пермь': 5,
        'Уфа': 3
    },
    {
        'Владивосток': 5,
        'Екатеринбург': 2,
        'Краснодар': 1,
        'Москва': 4,
        'Новосибирск': 6,
        'Самара': 4,
        'Тольятти': 7,
        'Тюмень': 5,
        'Ярославль': 5
    }
]


finl = {}

# проходимся по словарям
for i in cities:
    # операции для ключа и значения
    for city, number in i.items():
        # если ключа нет добавляем
        if city not in finl:
            finl[city] = {number}
        # если ключ есть то добавить тольо значение
        else:
            finl[city].add(number)
# вывод по паре            
for city, number in finl.items():
    print(f'"{city}": {number}')


# "Барнаул": {2}
# "Ижевск": {4}
# "Иркутск": {5, 6}
# "Казань": {1, 2, 4}
# "Новокузнецк": {5}
# "Пермь": {1, 5}
# "Уфа": {3, 5}
# "Хабаровск": {5}
# "Ярославль": {5}
# "Воронеж": {3}
# "Оренбург": {6}
# "Тюмень": {5}
# "Краснодар": {1, 6}
# "Красноярск": {7}
# "Новосибирск": {1, 6}
# "Владивосток": {5}
# "Екатеринбург": {2}
# "Москва": {4}
# "Самара": {4}
# "Тольятти": {7}